class ControlTest {
	/*
	1. 입력받은 값이 문자이면 "문자"라고 출력하고 그렇지 않으면 "기타"라고 출력
	*/
	System.out.println("입력 : ");
	int input = System.in.read();
	
	
	
	
	
	
	/*
	2. 입력받은 값이 소문자이면 소문자라고 출력하고 대문자이면 대문자라고 출력하고
		숫자면 숫자라고 출력하고 그 외에는 깉차라고 출력
	*/
	
	/*
	3. 간단한 전자계산기 (연산자에 q나 Q를 입력하면 종료)
		연산자 :
		숫자1 :
		숫자2 :
		결과 :
	*/
	
	
	
	
	
	/*
	1. 입력받은 값이 문자이면 "문자"라고 출력하고 그렇지 않으면 "기타"라고 출력
	*/


	/*
	2. 입력받은 값이 소문자이면 소문자라고 출력하고 대문자이면 대문자라고 출력하고
	숫자이면 숫자라고 출력하고 그 외에는 기타라고 출력
	*/

	/*
	3. 간단한 전자계산기 (연산자에 q나 Q를 입력하면 종료)
	연산자 : + 
	숫자1 : 2
	숫자2 : 4
	결과 : 2 + 4 = 6
	*/

	/*
	간단한 도움말 시스템을 만들자
	1. if
	2. switch
	3. while
	4. for
	번호선택 : 1
	if (조건식) 문장;

	1. if
	2. switch
	3. while
	4. for
	번호선택 : 3
	while (조건식) 문장;

	...

	번호선택 : 0을 누르면 종료
	*/

	/* 
	"." 입력이 될때까지 키보드 입력을 읽어서 입력된 공백의 갯수를 세고 그 합을 출력하시오.
	*/
}